Tobamalau/nrf52840/nRF5_SDK_15.3.0_59ac345/examples/peripheral/i2sTobi/main.c
   memset( message, 0, sizeof(message));
   setMacHead(message);
   IEEE802154_tx_in_progress = false;
   IEEE802154_tx_done        = false;

   nrf_802154_init();
   nrf_802154_auto_pending_bit_set(false);
   nrf_802154_auto_ack_set(false);
   nrf_802154_short_address_set(short_address);
   nrf_802154_extended_address_set(extended_address);
   nrf_802154_pan_id_set(pan_id);
   nrf_802154_channel_set(IEEECHANNEL);
   nrf_802154_receive();
   nrf_802154_tx_power_set(8);
}
void stopI2S()
{
   IEEEReciveActiv = false;
   I2sInProgress = false;
#if 0
   ReciveBufferPos = 0;
   ReciveBufferLoad = 0;
   DecodeBufferPos = 0;
#endif
   memset( rxUarteBuffer[0], 0, UARTE_RX_BUFF_SIZE);
   memset( rxUarteBuffer[1], 0, UARTE_RX_BUFF_SIZE);
   memset( rxUarteBuffer[2], 0, UARTE_RX_BUFF_SIZE);
#if !I2SHAL
   nrf_drv_i2s_stop();
#else
   NRF_I2S->EVENTS_TXPTRUPD = 0;
   NRF_I2S->TASKS_START = 0;
   NRF_I2S->TASKS_STOP = 1;
   *((volatile uint32_t *)0x40025038) = 1;/*Workaround for sdk issu*/
   *((volatile uint32_t *)0x4002503C) = 1;
#endif
   if(!UarteInRecive)
   {
      UarteInRecive = true;
      nrfx_uarte_rx(&m_uart, rxUarteBuffer[ReciveBufferPos], sizeof(rxUarteBuffer[ReciveBufferPos]));
   }               
}
void setMacHead(uint8_t *message)
{
   message[0] = 0x41;                // Set MAC header: short addresses, no ACK 0100 0001
   message[1] = 0x98;                // Set MAC header 1001 1000
   message[3] = DESTINATIONPAN&0xff;
   message[4] = (DESTINATIONPAN>>8)&0xff;
   message[5] = DESTINATION&0xff;
   message[6] = (DESTINATION>>8)&0xff;
   message[7] = SOURCE&0xff;
   message[8] = (SOURCE>>8)&0xff;
}
void sendStateToUart(char id)
{
   memset( txBuffer, 0, sizeof(txBuffer));
   int length = sprintf(txBuffer, "r%c%d%d%d\t%d\t%d\t%d", id, DecodeBufferPos, ReciveBufferLoad, ReciveBufferPos, timeIEEEsent, timeNewFrameSeq, timelastI2SLoop);
   if(id == 'I')
      txBuffer[length] = '\n';
   UarteInRecive = true;
   nrfx_uarte_rx(&m_uart, rxUarteBuffer[ReciveBufferPos], sizeof(rxUarteBuffer[ReciveBufferPos]));   
   nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer, UARTE_TX_BUFF_SIZE);
}
void nrf_802154_transmitted(const uint8_t * p_frame, uint8_t * p_ack, uint8_t length, int8_t power, uint8_t lqi)
{
   (void) p_frame;
   (void) length;
   (void) power;
   (void) lqi;
   timeIEEEsent = timerCnt;
   IEEE802154_tx_done = true;
   nrf_gpio_pin_toggle(BSP_LED_0);
   opusPackNb++;
   Counter32[_IEEETRANSMITTED]++;
   if (p_ack != NULL)
   {
     nrf_802154_buffer_free(p_ack);
   }
}
void nrf_802154_transmit_failed(const uint8_t * p_frame, nrf_802154_tx_error_t error)
{
   IEEE802154_tx_done = true;
   Counter16[_IEEETRANSFAILED]++;
}
void nrf_802154_cca_failed(nrf_802154_cca_error_t error)
{
   IEEE802154_tx_done = true;
   Counter16[_IEEECCAFAILED]++;
}
void nrf_802154_received(uint8_t * p_data, uint8_t length, int8_t power, uint8_t lqi)
{
   (void) power;
   (void) lqi;

   if (length > MAX_MESSAGE_SIZE + 2 || IEEE802154_tx_done || !isOpusPacket(p_data+MACHEAD, (length - MACHEAD - 2)))
     goto exit;
   memcpy(rxUarteBuffer[ReciveBufferPos], p_data + MACHEAD, (PAYLOAD + OPUSPACKHEAD));
   PacketNum = rxUarteBuffer[ReciveBufferPos][1];
   ReciveBufferLoad++;
   toggleBuffer(&ReciveBufferPos);   
   timeIEEEsent = timerCnt;

   if(!State && ReciveBufferLoad > 1)
      State = 2;
   
   nrf_gpio_pin_toggle(BSP_LED_1);
   Counter32[_IEEERECIVED]++;
   IEEEReciveActiv = true;
   PacketIsLost = false;
   
   memset( txBuffer2, 0, sizeof(txBuffer2));
   sprintf(txBuffer2, "RecTime:%d\tPackNum:%d\tBufLoad:%d\n", timerTotalCnt, PacketNum, ReciveBufferLoad);
   nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer2, sizeof(txBuffer2));
   
exit:
   nrf_802154_buffer_free(p_data);

   return;
}
#if TIMER_ENABLE
/**
 * @brief Handler for timer events.
 */
void timer_event_handler(nrf_timer_event_t event_type, void* p_context)
{
   switch (event_type)
   {
     case NRF_TIMER_EVENT_COMPARE0:
         timerCnt++;
         timerTotalCnt++;
         if(timerCnt == 1000)
            timerCnt = 0;
         if(timerTotalCnt == 50000)
            timerTotalCnt = 0;
         break;

     default:
         //Do nothing.
         break;
   }
}
#endif
// Interrupt handler
void GPIOTE_IRQHandler()
{
   memset( txBuffer, 0, sizeof(txBuffer));
   int length = sprintf(txBuffer, "lostP%d;ConInt%d", Counter16[_IEEELOSTPACKET], Counter16[_IEEECONINTERRUPT]);
   txBuffer[length] = '\n';
   nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer, UARTE_TX_BUFF_SIZE);
   NRF_GPIOTE->EVENTS_IN[0] = 0;
   nrf_gpio_pin_toggle(BSP_LED_3);

}
#if !I2SHAL
static void i2sdata_handler(nrf_drv_i2s_buffers_t const * p_released, uint32_t status)
{
   ASSERT(p_released);
   if (!(status & NRFX_I2S_STATUS_NEXT_BUFFERS_NEEDED))
     return;

   timelastI2SLoop = timerCnt; 
   if(timelastI2SLoop == 0)
     timerCnt = 0; 
   timerCnt = 0;
   timeNewFrameSeq = 0;
   timeIEEEsent = 0;
   nrf_drv_i2s_buffers_t const next_buffers = {
      //.p_rx_buffer = NULL,
      .p_tx_buffer = (uint32_t *)OpusInstanz.pcm_bytes[bufferNr],
   };
   APP_ERROR_CHECK(nrf_drv_i2s_next_buffers_set(&next_buffers));

   State = 2;
   toggleBuffer(&bufferNr);
}
#endif
void m_uart_callback(nrfx_uarte_event_t const * p_event, void * p_context)
{
   switch(p_event->type)
   {
      case NRFX_UARTE_EVT_TX_DONE:  
         break;

      case NRFX_UARTE_EVT_RX_DONE: 
         if(!UarteInRecive)
            break;
         if(!isOpusPacket(rxUarteBuffer[ReciveBufferPos], UARTE_RX_BUFF_SIZE) || IEEEReciveActiv)
         {
            nrfx_uarte_rx_abort(&m_uart); 
            UarteInRecive = true;
            nrfx_uarte_rx(&m_uart, rxUarteBuffer[ReciveBufferPos], sizeof(rxUarteBuffer[ReciveBufferPos]));
            break;
         }
         PacketNum = rxUarteBuffer[ReciveBufferPos][1];
         UarteInRecive = false;
         ReciveBufferLoad++;
         toggleBuffer(&ReciveBufferPos);       
         if(!UarteInRecive && ReciveBufferLoad < 2)
            sendStateToUart('E');
         if(!State && ReciveBufferLoad > 1)
            State = 2;
         break;

