Tobamalau/nrf52840/nRF5_SDK_15.3.0_59ac345/examples/peripheral/i2sTobi/main.c
      case NRFX_UARTE_EVT_ERROR:
         break;      
   }
}
void m_uart_context_callback()
{

}
void toggleBuffer(volatile uint8_t *buffer)
{
   (*buffer)++;
   if(*buffer == 3)
      *buffer = 0;
}
int main(void)
{
   initPeripheral();

   uint8_t IEEE802154_message[MAX_MESSAGE_SIZE];
   IEEE802154_init(IEEE802154_message);
 
   struct frame FrameInstanz = {&OpusInstanz, 0, 0};
   initOpusFrame(&FrameInstanz);

   uint8_t lastPacketRec = 0; 
   uint8_t lastPacketNumSent = 0;
   uint16_t lastLostPacketCnt = 0; 


   UarteInRecive = true;
   nrfx_uarte_rx(&m_uart, rxUarteBuffer[ReciveBufferPos], sizeof(rxUarteBuffer[ReciveBufferPos]));
   while (1)
   {
      /*### Statemachine ###*/
      switch(State)
      {
         case 0:  //Idle I2S Off
            break;
         case 1:  //Wait
            /* New I2S buffer*/
            if(NRF_I2S->EVENTS_TXPTRUPD  != 0)
            {
               timelastI2SLoop = timerCnt; 
               if(timelastI2SLoop == 0)
                 timerCnt = 0; 
               timerCnt = 0;
               NRF_I2S->TXD.PTR = (uint32_t)OpusInstanz.pcm_bytes[bufferNr];
               toggleBuffer(&bufferNr);
               NRF_I2S->EVENTS_TXPTRUPD = 0;
               State++;
            } 
            break;
         case 2:  //Buffer check
            if(!ReciveBufferLoad)   //No Buffer
            {
               if(IEEEReciveActiv)
               {
                  if((Counter16[_IEEELOSTPACKET]-lastLostPacketCnt < MAXLOSTPACKETS))
                  {
                     toggleBuffer(&bufferNr);                 //switch to latest Buffer
                     if(Counter16[_IEEELOSTPACKET] == lastLostPacketCnt)
                     {
                        lastPacketRec = PacketNum;
                     }
                     Counter16[_IEEELOSTPACKET]++;
                     memset( txBuffer2, 0, sizeof(txBuffer2));
                     sprintf(txBuffer2, "Timest: %d\tLostPack:%d\n", timerTotalCnt, Counter16[_IEEELOSTPACKET]);
                     nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer2, sizeof(txBuffer2));
                     State = 6;
                  }
                  else
                  {
                     lastPacketNumSent = PacketNum;
                     Counter16[_IEEECONINTERRUPT]++;
                     stopI2S();
                     State = 0;
                  }
               }
               else
               {
                  lastPacketNumSent = PacketNum;
                  stopI2S(); 
                  State = 0;
               }
               nrf_gpio_pin_toggle(BSP_LED_2);
               
            }   
            else  //Buffer available
            {
               if(lastLostPacketCnt != Counter16[_IEEELOSTPACKET])
               {
                  memset( txBuffer2, 0, sizeof(txBuffer2));
                  sprintf(txBuffer2, "LastPack: %d\tNewPack:%d\tLost:%d\tNotready:%d\tTotRec:%ld\n", lastPacketRec, PacketNum, (PacketNum-lastPacketRec-1), Counter16[_IEEENOTREADY], Counter32[_IEEERECIVED]);
                  nrfx_uarte_tx(&m_uart, (uint8_t *)txBuffer2, sizeof(txBuffer2));
                  lastLostPacketCnt = Counter16[_IEEELOSTPACKET];
               }
               lastPacketRec = 0;
               if(!isOpusPacket(rxUarteBuffer[DecodeBufferPos], UARTE_RX_BUFF_SIZE))
                  State = 6;
               else if(IEEEReciveActiv)
                  State = 4;
               else
                  State = 3;
            }
            break;

         case 3:         
            State = 4;
            break;

         case 4:  /*### Decode Frame ###*/
            FrameInstanz.opus_t->input = rxUarteBuffer[DecodeBufferPos] + 4;
            FrameInstanz.opus_t->nbBytes = UARTE_RX_BUFF_SIZE - 4;  
            //ReciveBufferLoad &= ~(1 << DecodeBufferPos);                   //Delet Bufferloadmemory
            ReciveBufferLoad--;
            //DecodeBufferPos ^= (1 << 0);                                   //switch to new Uart Buffer
            toggleBuffer(&DecodeBufferPos);

            /*new buffer request from Uarte*/
            if(!UarteInRecive && !IEEEReciveActiv)
               sendStateToUart('W');

            if(!getPcm(&FrameInstanz, bufferNr))
               APP_ERROR_CHECK(NRF_ERROR_BUSY);
            if(!I2sInProgress)
               State = 5;
            else
               State = 6;
            break;         

         case 5:  /*### Start I2S ###*/
#if !I2SHAL
            nrf_drv_i2s_buffers_t const initial_buffers = {
               .p_tx_buffer = (uint32_t *)OpusInstanz.pcm_bytes[bufferNr],
               //.p_rx_buffer = NULL,
            };
            APP_ERROR_CHECK(nrf_drv_i2s_start(&initial_buffers, FRAME_SIZE/2, 0));
#else
            NRF_I2S->TXD.PTR = (uint32_t)OpusInstanz.pcm_bytes[bufferNr];
            NRF_I2S->RXTXD.MAXCNT = FRAME_SIZE/2;
            NRF_I2S->TASKS_START = 1;
#endif
            I2sInProgress = true;
            toggleBuffer(&bufferNr);
            State = 6;
            break;

         case 6:  /*### Sequence End ###*/
            timeNewFrameSeq = timerCnt;
            State = 1;
            break;                      
      }
      if(lastPacketNumSent == 0xff && PacketNum == 0x01)
         lastPacketNumSent = 0;
      /*### IEEE802.15.4 transmitt asynchron ###*/  
      if(!IEEEReciveActiv && (lastPacketNumSent < PacketNum))
      {
         if (!IEEE802154_tx_in_progress)
         {
            memcpy(IEEE802154_message+MACHEAD ,rxUarteBuffer[DecodeBufferPos], (PAYLOAD + OPUSPACKHEAD));
            IEEE802154_message[2] = opusPackNb;
            IEEE802154_tx_in_progress = true;
            nrf_802154_transmit_csma_ca(IEEE802154_message, (uint8_t)MAX_MESSAGE_SIZE);
            if(opusPackNb == 0xff)
               opusPackNb = 0;
            lastPacketNumSent = PacketNum;
         }
         else if(lastPacketRec != opusPackNb)   //just for debugging
         {
            Counter16[_IEEENOTREADY]++;  
            lastPacketRec = opusPackNb;
         }
      }

      /*IEEE802.15.4 transmitted*/
      if (IEEE802154_tx_done)
      {
         IEEE802154_tx_in_progress = false;
         IEEE802154_tx_done   = false;
      }
      if(!nrf_gpio_pin_read(BSP_BUTTON_1))
      {
         memset( Counter16, 0, sizeof(Counter16)); 
         memset( Counter32, 0, sizeof(Counter32));
      }
   }
}
